## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:70" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:70" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:52366a6f00fe977cf90d91008347d3b5b65b29a39a348d493f5cb9f55ec30a20" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:c2df888917283c78ab4761358718453639b82ca8adb8325a4f092a79884dbce8"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 70 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "1c20e2981ffe32de303d870c85fee461-5" -> "8bfded951424de2173f7e84e38370dbe"
        id                     = "cpfValidation.8bfded951424de2173f7e84e38370dbe.zip"
        tags                   = {}
      ~ version_id             = "H1VDpHI323kgU2BPYadDkrLaGlSvYEgR" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "f8a1d02127b9258170e66ed0e23d40ee-6" -> "8b43ba7391dd216a4aa561029742fb90"
        id                     = "excelToJson.8b43ba7391dd216a4aa561029742fb90.zip"
        tags                   = {}
      ~ version_id             = "4L24t24.0BiMu40bcVPp5MOAzBpLBI7y" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "66e2053e57037af6c168df652f93ba4b-6" -> "fd55af0842b5401f1cd3cb239b22355a"
        id                     = "graphql.fd55af0842b5401f1cd3cb239b22355a.zip"
        tags                   = {}
      ~ version_id             = "cH88fbGGlxRS214pV.48QpRZG80jv3N." -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "08f243a44853aab2f38487fc4b6b1f30" -> "f1e833bbfc4ffd439e6fd155ed284c2c"
        id                     = "dist/200.html"
      ~ source_hash            = "08f243a44853aab2f38487fc4b6b1f30" -> "f1e833bbfc4ffd439e6fd155ed284c2c"
        tags                   = {}
      ~ version_id             = "1TlWtoywEiMXbLiGG7iLDCp4KUn1wLgu" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "1d959f7e6545a15332ab9ef2b1736472" -> "290000587f4fe0e072898eade99e912f"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "1d959f7e6545a15332ab9ef2b1736472" -> "290000587f4fe0e072898eade99e912f"
        tags                   = {}
      ~ version_id             = "Ov1JzuxmyrI4v2_uOfAXApFqZ3dBzjxL" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d53cd98f79466c65756530d07aa697d0" -> "f996a2797442a2e7f5992d0dc268a210"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "d53cd98f79466c65756530d07aa697d0" -> "f996a2797442a2e7f5992d0dc268a210"
        tags                   = {}
      ~ version_id             = "Hmd0qH1ymA9aJOl2UYcUsVQV5bP39XBV" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "08f243a44853aab2f38487fc4b6b1f30" -> "f1e833bbfc4ffd439e6fd155ed284c2c"
        id                     = "dist/index.html"
      ~ source_hash            = "08f243a44853aab2f38487fc4b6b1f30" -> "f1e833bbfc4ffd439e6fd155ed284c2c"
        tags                   = {}
      ~ version_id             = "fPmoC_4iNdqwpb80Ao7uam6vcfVZ1qeS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.87ebdefb.js"] will be destroyed
  # (because key ["static/js/app.87ebdefb.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f5a07cfe576625e8b2df9d48fa92f31f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.87ebdefb.js" -> null
-       key                    = "dist/static/js/app.87ebdefb.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.87ebdefb.js" -> null
-       source_hash            = "f5a07cfe576625e8b2df9d48fa92f31f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "SYmYAEqudcY7OZKyWGKlgmx8_gugJIAP" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.87ebdefb.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.87ebdefb.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.87ebdefb.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.87ebdefb.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.87ebdefb.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "yuyQ62CNomi4TTHeFik63GGDiWbHO0Qy" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b0f1595e.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "40d7f5b8f234664c773ffa3349840612"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.b0f1595e.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b0f1595e.js"
+       source_hash            = "40d7f5b8f234664c773ffa3349840612"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b0f1595e.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.b0f1595e.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b0f1595e.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:39" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:39/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "39" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "1c4b6830eff99f31b59f6a4526a4dac017f709ee" -> "4791128440fb6e916deab468b4b9f17be104c838"
              ~ "DD_TAGS"                      = "git.commit.sha:1c4b6830eff99f31b59f6a4526a4dac017f709ee,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4791128440fb6e916deab468b4b9f17be104c838,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "1c4b6830eff99f31b59f6a4526a4dac017f709ee" -> "4791128440fb6e916deab468b4b9f17be104c838"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "39" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:39" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:39/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "39" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "1c4b6830eff99f31b59f6a4526a4dac017f709ee" -> "4791128440fb6e916deab468b4b9f17be104c838"
              ~ "DD_TAGS"                      = "git.commit.sha:1c4b6830eff99f31b59f6a4526a4dac017f709ee,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4791128440fb6e916deab468b4b9f17be104c838,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "1c4b6830eff99f31b59f6a4526a4dac017f709ee" -> "4791128440fb6e916deab468b4b9f17be104c838"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "39" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:86" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:86/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "86" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "1c4b6830eff99f31b59f6a4526a4dac017f709ee" -> "4791128440fb6e916deab468b4b9f17be104c838"
              ~ "DD_TAGS"                            = "git.commit.sha:1c4b6830eff99f31b59f6a4526a4dac017f709ee,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4791128440fb6e916deab468b4b9f17be104c838,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "1c4b6830eff99f31b59f6a4526a4dac017f709ee" -> "4791128440fb6e916deab468b4b9f17be104c838"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "86" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 11 to change, 6 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8558563398)*